<script>
	import Papa from 'papaparse'
	import outcomeService from '@/services/outcome-service'
	import dateService from '@/services/date-service'



	const testinput = `"ЗАО «МТБанк»"
"улица Толстого, 10, 220007, г.Минск."
"http://www.mtbank.by"
"тел.: +375 17 229-98-89"
"Выписка по счету  BY06MTBK30140008000002006332"
"Клиент:","Коваленко Эдуард Евгеньевич","10.08.2017 г. 15:32:33"
"Название:","PayOkay"
"Номер счета:","BY06MTBK30140008000002006332"
"Номер и дата договора:","38779644 от 08.12.2015"
"Период выписки:","с 01.03.2017 г. по 31.03.2017 г."
"Входящий остаток:","89.34","BYN"
"поступило:","817.55","BYN"
"списано:","860.90","BYN"
"Исходящий остаток:","21.75","BYN"
Транзакции по счету с 01.03.2017 г. по 31.03.2017 г.
"1","Дата операции","Дата обработки","Место операции","Oписание операции","Карта","Валюта","Сумма в валюте операции","Сумма в валюте счета","Остаток счета"
"2","31.03.2017 23:27:30","31.03.2017","","Выплата рассчитанных процентов за период с 01.03.2017 по 31.03.2017 за остаток на тек.счете с банк.плат.карточкой для MASTERCARD MCW BYR 3Y (PAYOKAY).","","BYN","0.02","0.02","45.99"
"3","29.03.2017 10:12:22","31.03.2017","AZS N 22 BAPB / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-35.03","-35.03","45.97"
"4","29.03.2017 15:37:47","31.03.2017","PT MEDETSINSKI TSENTR / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-24.70","-24.70","81.00"
"5","29.03.2017 14:36:24","31.03.2017","UNIVERSAM "SOSEDI" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-4.49","-4.49","105.70"
"6","25.03.2017 16:32:39","28.03.2017","PIZZERIA "PIZZA TEMPO" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-16.07","-16.07","110.19"
"7","26.03.2017 20:43:31","28.03.2017","SHOP "EVROOPT" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-21.89","-21.89","126.26"
"8","25.03.2017 22:59:52","27.03.2017","P2P_MTBANK / MINSK / BY","Перевод на БПК МТБ в системе Р2Р","535104******1317","BYN","100.00","100.00","148.15"
"9","23.03.2017 15:14:16","27.03.2017","PLANETA SUSHI RESTAURA / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-6.40","-6.40","48.15"
"10","24.03.2017 23:57:10","27.03.2017","MTB INTERNET POS / MINSK / BY","Poezd.rw.by - Ж/д билеты | номер услуги 377801","535104******1317","BYN","-9.50","-9.50","54.55"
"11","24.03.2017 23:51:03","27.03.2017","MTB INTERNET POS / MINSK / BY","Poezd.rw.by - Ж/д билеты | номер услуги 377801","535104******1317","BYN","-10.92","-10.92","64.05"
"12","20.03.2017 14:20:27","22.03.2017","KAFE "AVTOGRAF" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-6.80","-6.80","84.87"
"13","18.03.2017 21:53:31","21.03.2017","I.-SHOP "MENU.BY" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-29.00","-29.00","91.67"
"14","20.03.2017 09:00:49","20.03.2017","MTB INTERNET POS / MINSK / BY","МТС по N телефона | номер услуги 393931","535104******1317","BYN","-11.39","-11.39","120.67"
"15","17.03.2017 16:08:10","20.03.2017","UNIVERSAM "SOSEDI" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-4.99","-4.99","132.06"
"16","18.03.2017 12:00:30","20.03.2017","MTB INTERNET POS / MINSK / BY","Сити-2011 | номер услуги 425101","535104******1317","BYN","-10.56","-10.56","137.05"
"17","15.03.2017 15:21:09","17.03.2017","UNIVERSAM "SOSEDI" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-0.77","-0.77","147.61"
"18","15.03.2017 15:10:19","17.03.2017","PLANETA SUSHI RESTAURA / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-6.80","-6.80","148.38"
"19","14.03.2017 20:36:10","16.03.2017","SHOP "EVROOPT" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-33.02","-33.02","155.18"
"20","14.03.2017 15:17:53","16.03.2017","PLANETA SUSHI RESTAURA / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-5.80","-5.80","188.20"
"21","15.03.2017 09:02:13","15.03.2017","MTB INTERNET POS / MINSK / BY","Оплата в Интернет-банке","535104******1317","BYN","-2.81","-2.81","194.00"
"22","15.03.2017 09:02:10","15.03.2017","MTB INTERNET POS / MINSK / BY","Оплата в Интернет-банке","535104******1317","BYN","-34.08","-34.08","196.81"
"23","13.03.2017 16:07:02","15.03.2017","PLANETA PIZZY SURGANOV / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-7.95","-7.95","230.89"
"24","11.03.2017 19:48:02","14.03.2017","Dominospizza / Minsk / BY","Оплата товаров и услуг","535104******1317","BYN","-14.20","-14.20","238.84"
"25","09.03.2017 21:37:56","13.03.2017","AZS N 43 MINSKAVTOZAPR / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-41.16","-41.16","253.04"
"26","07.03.2017 14:04:22","13.03.2017","DOMINOSPIZZA / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-69.90","-69.90","294.20"
"27","10.03.2017 12:27:49","10.03.2017","MTB INTERNET POS / MINSK / BY","Перевод на карту другого клиента","535104******1317","BYN","8.10","8.10","364.10"
"28","08.03.2017 12:25:36","10.03.2017","PARFUMERIA.BY STORE / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-82.00","-82.00","356.00"
"29","10.03.2017 05:31:07","10.03.2017","","Комиссия за снятие наличных в чужих ATM","","BYN","-0.75","-0.75","438.00"
"30","07.03.2017 14:01:20","10.03.2017","ATMMMB HO25 TC RIGA / MINSK / BY","Снятие наличных в чужих АТМ, ПВН, иных устройствах","535104******1317","BYN","-30.00","-30.00","438.75"
"31","09.03.2017 09:00:50","09.03.2017","MTB INTERNET POS / MINSK / BY","Byfly,ZALA,Максифон,Умный дом | номер услуги 4521","535104******1317","BYN","-12.00","-12.00","468.75"
"32","07.03.2017 20:54:38","09.03.2017","UNIVERSAM "SOSEDI" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-9.28","-9.28","480.75"
"33","07.03.2017 21:41:21","09.03.2017","SHOP "EVROOPT" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-15.53","-15.53","490.03"
"34","06.03.2017 15:09:23","09.03.2017","PIZZERIA "PIZZA TEMPO" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-16.20","-16.20","505.56"
"35","07.03.2017 14:58:00","07.03.2017","MTB INTERNET POS / MINSK / BY","Перевод на карту другого клиента","535104******1317","BYN","21.50","21.50","521.76"
"36","07.03.2017 14:53:32","07.03.2017","MTB INTERNET POS / MINSK / BY","Перевод на карту другого клиента","535104******1317","BYN","26.65","26.65","500.26"
"37","07.03.2017 14:53:03","07.03.2017","MTB INTERNET POS / MINSK / BY","Перевод на карту другого клиента","535104******1317","BYN","11.65","11.65","473.61"
"38","04.03.2017 12:45:34","07.03.2017","PT ZAKUSOCHN. "METROMI / BREST / BY","Оплата товаров и услуг","535104******1317","BYN","-24.00","-24.00","461.96"
"39","07.03.2017 11:50:01","07.03.2017","MTB INTERNET POS / MINSK / BY","Обучение | номер услуги 4401","535104******1317","BYN","-155.20","-155.20","485.96"
"40","04.03.2017 23:12:45","07.03.2017","SHOP "EVROOPT" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-22.24","-22.24","641.16"
"41","04.03.2017 17:21:03","06.03.2017","CAFES LA BRASILENA / BREST / BY","Оплата товаров и услуг в сети МТБанка","535104******1317","BYN","-15.00","-15.00","663.40"
"42","04.03.2017 15:22:32","06.03.2017","MTB RKC 19 / BREST / BY","Пополнение наличными в ПВН МТБанка","535104******1317","BYN","645.00","645.00","678.40"
"43","02.03.2017 21:16:30","06.03.2017",""GALILEO SILVER SCREEN / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-8.00","-8.00","33.40"
"44","02.03.2017 13:41:04","06.03.2017","KAFE "AVTOGRAF" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-7.67","-7.67","41.40"
"45","03.03.2017 13:06:29","03.03.2017","MTB INTERNET POS / MINSK / BY","Poezd.rw.by - Ж/д билеты | номер услуги 377801","535104******1317","BYN","-7.96","-7.96","49.07"
"46","03.03.2017 13:04:17","03.03.2017","MTB INTERNET POS / MINSK / BY","Poezd.rw.by - Ж/д билеты | номер услуги 377801","535104******1317","BYN","-7.96","-7.96","57.03"
"47","28.02.2017 14:42:37","02.03.2017","SHOP "EVROOPT" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-4.23","-4.23","64.99"
"48","28.02.2017 14:25:08","02.03.2017",""WWW.SILVERSCREEN.BY"B / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-16.00","-16.00","69.22"
"49","01.03.2017 11:36:30","01.03.2017","","Начисление Cash-back в рамках продукта PayOkay за Февраль по номеру договора 38779644","","BYN","4.63","4.63","85.22"
"50","26.02.2017 22:07:38","01.03.2017","RESTORAN "MCDONALDS" / MINSK / BY","Оплата товаров и услуг","535104******1317","BYN","-8.75","-8.75","80.59"
"Типы операций"
"T - сумма обработана"
"A - сумма блокирована (ожидает обработки)"
"E - ошибка выполнения операции"
"Исходящий остаток:","21.75","BYN"
`

	export default {
		name: 'importer',

		created: function() {
			outcomeService.events.$on('updated', (data) => {
				this.categories = data.categories
			})

			this.categories = outcomeService.getCategories()
		},

		mounted: function() {
			this.parse()
		},

		methods: {
			parse: function() {
				const result = Papa.parse(testinput)

				const len = {}
				result.data.forEach((item) => {
					len[item.length] = len[item.length] ? len[item.length] + 1 : 1
				})

				let max = 0
				let length
				for (let key in len) {
					if (len[key] > max) {
						max = len[key]
						length = key
					}
				}

				this.parsedCSV = result.data.filter(item => item.length == length)
				return this.parsedCSV
			},



			convertToDatasheet: function(data) {
				this.postCSV = data.items

				const cur = data.mapNames.indexOf('curency')
				const cat = data.mapNames.indexOf('category')
				const dat = data.mapNames.indexOf('date')
				const amo = data.mapNames.indexOf('amount')
				const des = data.mapNames.indexOf('description')

				const dateFormat = dateService.determineDateFormat(data.items.map(item=>item[dat]))


				this.processedItems = data.items.map((row) => {
					return {
						category: cat != -1 ? row[cat] : '',
						date: dat != -1 ? dateService.strToTimestamp(row[dat], dateFormat) : +new Date(),
						amount: amo != -1 ? row[amo] : '0',
						description: des != -1 ? row[des] : '',
					}
				})

			},
		},

		data() {
			return {
				parsedCSV: [],
				postCSV: [],
				processedItems: [],

				mapColumns: [],
				outcomeService,
			}
		},
	}
</script>

<template>
	<div>
		<input type="file" placeholder="load csv file" ref="file">
		<!--<app-datasheet-widget title="Outcome" :service="outcomeService"></app-datasheet-widget>-->

		<app-csv-table-widget
			:input="parsedCSV"
			@change="convertToDatasheet"
		></app-csv-table-widget>

		<app-datasheet-widget
			:items="processedItems"
			:categories="categories"
		></app-datasheet-widget>
	</div>
</template>


<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
	h1, h2 {
		font-weight: normal;
	}

	ul {
		list-style-type: none;
		padding: 0;
	}

	li {
		display: inline-block;
		margin: 0 10px;
	}

	a {
		color: #42b983;
	}
</style>
